Revit 2027 API
HermiteFace Class
A cubic hermite spline face of a 3d solid or open shell.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Face
 Autodesk.Revit.DB.HermiteFace
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HermiteFace : Face
Public Class HermiteFace
	Inherits Face
public ref class HermiteFace : public Face
type HermiteFace =
    class
        inherit Face
    end
The HermiteFace type exposes the following members.
Properties
Name | Description
Area | The area of this face.
(Inherited from Face)
EdgeLoops | A collection of edge loops. Each edge loop represents one of the closed boundaries of the face.
(Inherited from Face)
GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle
(Inherited from GeometryObject)
HasRegions | Identifies if the face contains regions (which can be created, for example, by the Split Face command).
(Inherited from Face)
Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.
(Inherited from GeometryObject)
IsCyclic | Indicates whether the underlying surface is periodic in the specified parametric direction.
(Inherited from Face)
IsElementGeometry | Indicates whether this geometry is obtained directly from an Element.
(Inherited from GeometryObject)
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
IsTwoSided | Determines if a face is two-sided (degenerate).
(Inherited from Face)
MaterialElementId | The element ID of the material from which this face is composed.
(Inherited from Face)
MixedDerivs | Mixed derivatives of the surface.
OrientationMatchesSurfaceOrientation |  Returns true if this face's orientation matches the orientation of the face's surface, false if they have opposite orientations.
(Inherited from Face)
Params | Parameters of the surface.
Period | The period of the underlying surface in the specified parametric direction.
(Inherited from Face)
Points | Interpolation points of the surface.
Reference | Returns a stable reference to the face.
(Inherited from Face)
Tangents | Tangents of the surface.
Visibility | The visibility.
(Inherited from GeometryObject)
Top
Methods
Name | Description
ComputeDerivatives | Returns the first partial derivatives of the underlying surface at the specified point.
(Inherited from Face)
ComputeNormal | Returns the normal vector for the face at the given point.
(Inherited from Face)
ComputeSecondDerivatives | Returns the second partial derivatives of the face at the specified point.
(Inherited from Face)
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals |  Determines whether the specified Object is equal to the current Object.
(Inherited from GeometryObject)
Evaluate | Evaluates and returns the XYZ coordinates of a point at the indicated UV parameterization of the face.
(Inherited from Face)
GetBoundingBox | Returns the UV bounding box of the face.
(Inherited from Face)
GetEdgesAsCurveLoops | Returns a list of closed curve loops that correspond to the edge loops of the face. Curves in each curve loop correspond to individual edges.
(Inherited from Face)
GetHashCode |  Gets the integer value of the geometry object as hash code
(Inherited from GeometryObject)
GetRegions | Gets the face regions (created, for example, by the Split Face command) of the face.
(Inherited from Face)
GetSurface | Returns a copy of this face's surface.
(Inherited from Face)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Intersect(Curve) | Calculates the intersection of the specified curve with this face.
(Inherited from Face)
Intersect(Face) | Calculates the intersection of the specified face with this face and returns the intersection results.
(Inherited from Face)
Intersect(Curve, IntersectionResultArray) | Calculates the intersection of the specified curve with this face and returns the intersection results.
(Inherited from Face)
Intersect(Face, Curve) | Calculates the intersection of the specified face with this face and returns the intersection results.
(Inherited from Face)
IsInside(UV) | Indicates whether the specified point is within this face.
(Inherited from Face)
IsInside(UV, IntersectionResult) | Indicates whether the specified point is within this face and outputs additional information about the point location.
(Inherited from Face)
Project | Projects the specified point on the face.
(Inherited from Face)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Triangulate() | Returns a triangular mesh approximation to the face.
(Inherited from Face)
Triangulate(Double) | Returns a triangular mesh approximation to the face.
(Inherited from Face)
Top
Remarks
Hermite faces are defined by cubic hermite spline surfaces bounded by edge loops. The surfaces provide natural UV parameterization to the faces.
Example
private void GetHermiteFaceInfo(Face face)
{
    HermiteFace hermiteFace = face as HermiteFace;
    if (null != hermiteFace)
    {
        IList<XYZ> points = hermiteFace.Points;
        IList<XYZ> derivs = hermiteFace.MixedDerivs;
        DoubleArray faceParams = hermiteFace.get_Params(0);
        IList<XYZ> tangents = hermiteFace.get_Tangents(0);
    }
}
See Also
Reference
Autodesk.Revit.DB Namespace